using-style-dictionaries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-24 Thu 18:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using "style-dictionary" from Clojure.</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<link rel="stylesheet" href="reset.css">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="using design tokens from Clojure" />
<meta http-equiv="Content-Security-Policy"  content="script-src 'self' ajax.googleapis.com;"" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using "style-dictionary" from Clojure.</h1>

<div id="outline-container-org67082fa" class="outline-2">
<h2 id="org67082fa">Summary:</h2>
<div class="outline-text-2" id="text-org67082fa">
<p>
A Style Dictionary is a system that allows you to define styles once, in a way for any platform or language to consume.
A single place to create and edit your styles, and a single command exports these rules to all the places you need them - iOS,
Android, CSS, JS, HTML, sketch files, style documentation, etc.
</p>
</div>
</div>

<div id="outline-container-org93c3fd0" class="outline-2">
<h2 id="org93c3fd0">Introduction</h2>
<div class="outline-text-2" id="text-org93c3fd0">
<p>
I'm working on a tool to update slack with details from the goings on from jira.  I am
the interest of theming things along with the corporate style, I found out that 'style-dictionaries'
are a tool that allows you to reference them in a json document.
</p>

<p>
I don't write clojurescript, I render my html serverside, so I'm documenting what worked for me.
</p>

<p>
According to the official <a href="https://amzn.github.io/style-dictionary/#/README">style dictionary site</a>:
</p>

<pre class="example" id="org4d24ba4">

A style dictionary consists of:

- Design tokens, organized in JSON, JSONC, JSON5, or JS files
- Static assets (e.g. fonts, icons, images, sounds, etc.), organized into folders
- Configuration, defining the transformation and formatting of the tokens and assets for each output platform

</pre>

<p>
In the example repo I have found there isn't much in regards to static assetts.  
</p>

<p>
I believe the goal is to transform the styles across different tools/document formats so that there is some kind of visual
consistency.
</p>

<p>
I'm using the <a href="https://github.com/RedHat-UX/red-hat-design-tokens">Red Hat Design Tokens</a> repo as the the source for my style dictionary.
</p>

<p>
They seem to call their tooling "design tokens" rather than "style dictionary", maybe these terms can be used interchangably.  If you can
explain what the complexities here easily, please drop me a line.
</p>
</div>

<div id="outline-container-org2a38abf" class="outline-3">
<h3 id="org2a38abf">Getting the 'design tokens' / 'style dictionary'.</h3>
<div class="outline-text-3" id="text-org2a38abf">
<p>
Git clone the repository into your 'resources' folder.  This is the location where we expect to see all non clojure / resources in a clojure project.
</p>

<div class="org-src-container">
<pre class="src src-shell">$ git clone https://github.com/RedHat-UX/red-hat-design-tokens.git resources/red-hat-design-tokens
</pre>
</div>

<p>
This looks like a "npm" project.  There is no hard requirement for a style dictionary to be an NPM project,
in this case the goal would be to turn the raw data into multiple 'styling formats'.  I really only care
about the css style in this example. 
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cd resources/red-hat-design-tokens
$ npm install
$ npm run build
</pre>
</div>

<p>
This downloaded and installs the build toolchain, then builds the 'style dictionary' across the different formats.
</p>

<p>
I imagine this only needs to be done once.
</p>

<p>
The files it generated were created in the ./json
</p>

<p>
#+BEGIN_SRC shell
</p>

<p>
$ tree
.
├── rhds.tokens.flat.json
└── rhds.tokens.json
</p>

<p>
 1 directory, 2 files
#END_SRC
</p>
</div>
</div>

<div id="outline-container-org8e6c96c" class="outline-3">
<h3 id="org8e6c96c">Using the token json files.</h3>
<div class="outline-text-3" id="text-org8e6c96c">
<p>
Its so easy, I barely think it worth writing a library for it.  Here is how I did it:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #eaeaea;">(</span><span style="color: #b9ca4a;">ns</span> <span style="color: #7aa6da;">simple-web-app.theme</span>
  <span style="color: #70c0b1;">(</span><span style="color: #7aa6da;">:require</span> <span style="color: #e7c547;">[</span>cheshire.core <span style="color: #7aa6da;">:as</span> json<span style="color: #e7c547;">]</span>
            <span style="color: #e7c547;">[</span>clojure.java.io <span style="color: #7aa6da;">:as</span> io<span style="color: #e7c547;">]</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>

<span style="color: #eaeaea;">(</span><span style="color: #b9ca4a;">defn</span> <span style="color: #e78c45;">load-style-dict</span> <span style="color: #70c0b1;">[</span>path<span style="color: #70c0b1;">]</span>
  <span style="color: #70c0b1;">(</span><span style="color: #b9ca4a;">with-open</span> <span style="color: #e7c547;">[</span>r <span style="color: #b9ca4a;">(</span><span style="color: #7aa6da;">io</span>/reader path<span style="color: #b9ca4a;">)</span><span style="color: #e7c547;">]</span>
    <span style="color: #e7c547;">(</span><span style="color: #7aa6da;">json</span>/parse-stream r <span style="color: #7aa6da;">true</span><span style="color: #e7c547;">)</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>

<span style="color: #eaeaea;">(</span><span style="color: #b9ca4a;">def</span> <span style="color: #e7c547;">style-dictionary</span>
  <span style="color: #70c0b1;">(</span>load-style-dictionary <span style="color: #70c0b1;">"resources/red-hat-design-tokens/json/rhds.tokens.json"</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>

<span style="color: #eaeaea;">(</span><span style="color: #b9ca4a;">defn</span> <span style="color: #e78c45;">get-style</span> <span style="color: #70c0b1;">[</span>l<span style="color: #70c0b1;">]</span>
  <span style="color: #70c0b1;">(</span>get-in style-dictionary l<span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>
</pre>
</div>

<p>
I am not sure its worth publishing this into a jar, because its so small, but
you can use normal clojure syntax to find the elements.
</p>

<p>
The Red Hat style supplies a 'flat' and a 'heierachial' json files, I don't know if this
is required or not, but it seems as though there is some additional logic encoded in the
herierachal 
</p>


<p>
You can investigate the 'top level' keys with clojure commands.
</p>

<div class="org-src-container">
<pre class="src src-clojure">user&gt;  <span style="color: #eaeaea;">(</span>keys <span style="color: #70c0b1;">(</span><span style="color: #7aa6da;">simple-web-app.theme</span>/get-style <span style="color: #e7c547;">[]</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>

<span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">:line-height</span>
 <span style="color: #7aa6da;">:space</span>
 <span style="color: #7aa6da;">:box-shadow</span>
 <span style="color: #7aa6da;">:animation</span>
 <span style="color: #7aa6da;">:color</span>
 <span style="color: #7aa6da;">:breakpoint</span>
 <span style="color: #7aa6da;">:font</span>
 <span style="color: #7aa6da;">:size</span>
 <span style="color: #7aa6da;">:opacity</span>
 <span style="color: #7aa6da;">:length</span>
 <span style="color: #7aa6da;">:letter-spacing</span>
 <span style="color: #7aa6da;">:border</span>
 <span style="color: #7aa6da;">:media</span><span style="color: #eaeaea;">)</span>

</pre>
</div>

<p>
And then query those &#x2026;
</p>

<div class="org-src-container">
<pre class="src src-clojure">user&gt; <span style="color: #eaeaea;">(</span>keys <span style="color: #70c0b1;">(</span><span style="color: #7aa6da;">simple-web-app.theme</span>/get-style <span style="color: #e7c547;">[</span><span style="color: #7aa6da;">:color</span><span style="color: #e7c547;">]</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>
<span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">:orange</span>
 <span style="color: #7aa6da;">:$extensions</span>
 <span style="color: #7aa6da;">:white-hsl</span>
 <span style="color: #7aa6da;">:gray</span>
 <span style="color: #7aa6da;">:white</span>
 <span style="color: #7aa6da;">:interactive</span>
 <span style="color: #7aa6da;">:yellow</span>
 <span style="color: #7aa6da;">:green</span>
 <span style="color: #7aa6da;">:black-hsl</span>
 <span style="color: #7aa6da;">:icon</span>
 <span style="color: #7aa6da;">:canvas</span>
 <span style="color: #7aa6da;">:brand</span>
 <span style="color: #7aa6da;">:black-rgb</span>
 <span style="color: #7aa6da;">:white-rgb</span>
 <span style="color: #7aa6da;">:red-orange</span>
 <span style="color: #7aa6da;">:status</span>
 <span style="color: #7aa6da;">:red</span>
 <span style="color: #7aa6da;">:blue</span>
 <span style="color: #7aa6da;">:teal</span>
 <span style="color: #7aa6da;">:purple</span>
 <span style="color: #7aa6da;">:border</span>
 <span style="color: #7aa6da;">:accent</span>
 <span style="color: #7aa6da;">:surface</span>
 <span style="color: #7aa6da;">:text</span>
 <span style="color: #7aa6da;">:black</span><span style="color: #eaeaea;">)</span>
</pre>
</div>

<p>
Then look up the :blue..
</p>

<div class="org-src-container">
<pre class="src src-clojure">user&gt; <span style="color: #eaeaea;">(</span>keys <span style="color: #70c0b1;">(</span><span style="color: #7aa6da;">simple-web-app.theme</span>/get-style <span style="color: #e7c547;">[</span><span style="color: #7aa6da;">:color</span> <span style="color: #7aa6da;">:blue</span><span style="color: #e7c547;">]</span><span style="color: #70c0b1;">)</span><span style="color: #eaeaea;">)</span>
</pre>
</div>

<p>
and the "40" variant until you get to a :$value.  
</p>

<div class="org-src-container">
<pre class="src src-clojure">user&gt; <span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">simple-web-app.theme</span>/get-style <span style="color: #70c0b1;">[</span><span style="color: #7aa6da;">:color</span> <span style="color: #7aa6da;">:blue</span> <span style="color: #7aa6da;">:40</span> <span style="color: #7aa6da;">:$value</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
      <span style="color: #70c0b1;">"#4394e5"</span>
</pre>
</div>

<p>
There are some thematic choices included in the theming, including
the expectations of font colors, for example
</p>

<div class="org-src-container">
<pre class="src src-clojure">user&gt; <span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">simple-web-app.theme</span>/get-style <span style="color: #70c0b1;">[</span><span style="color: #7aa6da;">:color</span> <span style="color: #7aa6da;">:text</span> <span style="color: #7aa6da;">:primary</span> <span style="color: #7aa6da;">:on-light</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
<span style="color: #eaeaea;">{</span><span style="color: #7aa6da;">:path</span> <span style="color: #70c0b1;">[</span><span style="color: #70c0b1;">"color"</span> <span style="color: #70c0b1;">"text"</span> <span style="color: #70c0b1;">"primary"</span> <span style="color: #70c0b1;">"on-light"</span><span style="color: #70c0b1;">]</span>,
 <span style="color: #7aa6da;">:$type</span> <span style="color: #70c0b1;">"color"</span>,
 <span style="color: #7aa6da;">:isSource</span> <span style="color: #7aa6da;">true</span>,
 <span style="color: #7aa6da;">:$description</span> <span style="color: #70c0b1;">"Primary text color for light theme"</span>,
 <span style="color: #7aa6da;">:name</span> <span style="color: #70c0b1;">"rh-color-text-primary-on-light"</span>,
 <span style="color: #7aa6da;">:original</span>
 <span style="color: #70c0b1;">{</span><span style="color: #7aa6da;">:$value</span> <span style="color: #70c0b1;">"{color.gray.95}"</span>,
  <span style="color: #7aa6da;">:$description</span> <span style="color: #70c0b1;">"Primary text color for light theme"</span>,
  <span style="color: #7aa6da;">:attributes</span> <span style="color: #e7c547;">{</span><span style="color: #7aa6da;">:category</span> <span style="color: #70c0b1;">"typography"</span>, <span style="color: #7aa6da;">:type</span> <span style="color: #70c0b1;">"color"</span><span style="color: #e7c547;">}</span>,
  <span style="color: #7aa6da;">:$type</span> <span style="color: #70c0b1;">"color"</span><span style="color: #70c0b1;">}</span>,
 <span style="color: #7aa6da;">:$value</span> <span style="color: #70c0b1;">"#151515"</span>,
 <span style="color: #7aa6da;">:filePath</span> <span style="color: #70c0b1;">"tokens/color/text.yaml"</span>,
 <span style="color: #7aa6da;">:attributes</span>
 <span style="color: #70c0b1;">{</span><span style="color: #7aa6da;">:category</span> <span style="color: #70c0b1;">"typography"</span>,
  <span style="color: #7aa6da;">:isLight</span> <span style="color: #7aa6da;">false</span>,
  <span style="color: #7aa6da;">:item</span> <span style="color: #70c0b1;">"primary"</span>,
  <span style="color: #7aa6da;">:rgb</span> <span style="color: #e7c547;">{</span><span style="color: #7aa6da;">:r</span> 21, <span style="color: #7aa6da;">:g</span> 21, <span style="color: #7aa6da;">:b</span> 21, <span style="color: #7aa6da;">:a</span> 1<span style="color: #e7c547;">}</span>,
  <span style="color: #7aa6da;">:subitem</span> <span style="color: #70c0b1;">"on-light"</span>,
  <span style="color: #7aa6da;">:type</span> <span style="color: #70c0b1;">"color"</span>,
  <span style="color: #7aa6da;">:hsl</span> <span style="color: #e7c547;">{</span><span style="color: #7aa6da;">:h</span> 0, <span style="color: #7aa6da;">:s</span> 0, <span style="color: #7aa6da;">:l</span> 8.235294117647058, <span style="color: #7aa6da;">:a</span> 1<span style="color: #e7c547;">}</span>,
  <span style="color: #7aa6da;">:hsv</span> <span style="color: #e7c547;">{</span><span style="color: #7aa6da;">:h</span> 0, <span style="color: #7aa6da;">:s</span> 0, <span style="color: #7aa6da;">:v</span> 0.08235294117647059, <span style="color: #7aa6da;">:a</span> 1<span style="color: #e7c547;">}</span>,
  <span style="color: #7aa6da;">:hex</span> <span style="color: #70c0b1;">"151515"</span><span style="color: #70c0b1;">}</span><span style="color: #eaeaea;">}</span>

</pre>
</div>

<p>
Along with its 'dark sibling'
</p>

<div class="org-src-container">
<pre class="src src-clojure">user&gt;  <span style="color: #eaeaea;">(</span><span style="color: #7aa6da;">simple-web-app.theme</span>/get-style <span style="color: #70c0b1;">[</span><span style="color: #7aa6da;">:color</span> <span style="color: #7aa6da;">:text</span> <span style="color: #7aa6da;">:primary</span> <span style="color: #7aa6da;">:on-dark</span><span style="color: #70c0b1;">]</span><span style="color: #eaeaea;">)</span>
....
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8aeb4be" class="outline-2">
<h2 id="org8aeb4be">Conclusion</h2>
<div class="outline-text-2" id="text-org8aeb4be">
<p>
Its not hard to use these themes in clojure for your server side rendering.
</p>
</div>
</div>

<div id="outline-container-org15d56b4" class="outline-2">
<h2 id="org15d56b4">Resources:</h2>
<div class="outline-text-2" id="text-org15d56b4">
<p>
<a href="https://amzn.github.io/style-dictionary/#/README">https://amzn.github.io/style-dictionary/#/README</a>
</p>
</div>
</div>
</div>
</body>
</html>
